app/views/users/index.html.erb

	  <tbody>
		<% User.all.where.not(id: current_user.id).each do |user| %>
---
SELECT "users".* FROM "users"